app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: 'You have creatad book successfully.'
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "jvijitv"], ["body", "ckdmivjhtvbuihtyubhgubg"], ["user_id", 1], ["created_at", "2021-06-26 06:21:33.619283"], ["updated_at", "2021-06-26 06:21:33.619283"]]
SELECT "books".* FROM "books"

    def ensure_correct_user
      @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]